{
    "format": "layers-model",
    "generatedBy": "TensorFlow.js tfjs-layers v3.6.0",
    "convertedBy": "TensorFlow.js Converter v3.6.0",
    "modelTopology": {
        "keras_version": "2.3.0-tf",
        "backend": "tensorflow",
        "config": {
            "name": "sequential",
            "layers": [
                {
                    "class_name": "InputLayer",
                    "config": {
                        "batch_input_shape": [null, 28, 28, 1],
                        "dtype": "float32",
                        "name": "input"
                    }
                },
                {
                    "class_name": "Flatten",
                    "config": {
                        "name": "flatten",
                        "data_format": "channels_last"
                    }
                },
                {
                    "class_name": "Dense",
                    "config": {
                        "name": "dense_1",
                        "units": 128,
                        "activation": "relu",
                        "use_bias": true,
                        "kernel_initializer": {
                            "class_name": "VarianceScaling",
                            "config": {
                                "scale": 1.0,
                                "mode": "fan_avg",
                                "distribution": "uniform",
                                "seed": null
                            }
                        },
                        "bias_initializer": {
                            "class_name": "Zeros",
                            "config": {}
                        }
                    }
                },
                {
                    "class_name": "Dense",
                    "config": {
                        "name": "dense_2",
                        "units": 10,
                        "activation": "softmax",
                        "use_bias": true,
                        "kernel_initializer": {
                            "class_name": "VarianceScaling",
                            "config": {
                                "scale": 1.0,
                                "mode": "fan_avg",
                                "distribution": "uniform",
                                "seed": null
                            }
                        },
                        "bias_initializer": {
                            "class_name": "Zeros",
                            "config": {}
                        }
                    }
                }
            ]
        }
    },
    "training_config": {
        "loss": "categorical_crossentropy",
        "metrics": [
            "accuracy"
        ],
        "optimizer_config": {
            "class_name": "Adam",
            "config": {
                "learning_rate": 0.001,
                "beta_1": 0.9,
                "beta_2": 0.999,
                "epsilon": 1e-07,
                "amsgrad": false
            }
        }
    },
    "weightsManifest": [
        {
            "paths": [
                "group1-shard1of1.bin"
            ],
            "weights": [
                {
                    "name": "dense_1/kernel",
                    "shape": [784, 128],
                    "dtype": "float32"
                },
                {
                    "name": "dense_1/bias",
                    "shape": [128],
                    "dtype": "float32"
                },
                {
                    "name": "dense_2/kernel",
                    "shape": [128, 10],
                    "dtype": "float32"
                },
                {
                    "name": "dense_2/bias",
                    "shape": [10],
                    "dtype": "float32"
                }
            ]
        }
    ]
}
